{
    "header": {
      "name": "रोहित मीरचंदानी",
      "exp": "अनुभव",
      "achivs": "उपलब्धियां"
    },
    "intro":{
      "interest": "यह एप्लिकेशन Olecons के लिए कार्य का हिस्सा है। नमस्ते, मेरा नाम रोहित मिर्चंदानी है और मैं आपकी कंपनी में फ्रंटएंड डेवलपर पद में अपनी मजबूत रुचि व्यक्त करने के लिए यहाँ लिख रहा हूँ। एक हाल के स्नातक जो MERN स्टैक में मजबूत नींव रखता है और वेब डेवलपमेंट के प्रति गहरी रुचि रखता है, मैं आपकी गतिशील टीम में अपने कौशल और उत्साह को योगदान करने का मौका ताकदवर परम्परा है।",
      "experience": "मेरे शैक्षिक और व्यक्तिगत प्रोजेक्ट्स के कोर्स के दौरान, मैंने प्रतिक्रियाशील और उपयोगकर्ता-मित्र वेब एप्लिकेशन बनाने का अभ्यास किया है। मेरी MERN (MongoDB, Express.js, React, Node.js) स्टैक में माहिरी ने मुझे मजबूत और स्कैलेबल वेब समाधान विकसित करने की अनुमति दी है। मुझे आधुनिक वेब डेवलपमेंट प्रैक्टिस की गहरी समझ है, जिसमें RESTful APIs, स्थिति प्रबंधन, और घटक-आधारित शैली का उपयोग करने की जाती है, जिन्हें मैंने लगभग 15-20 फ्रंटएंड और फुल-स्टैक प्रोजेक्ट्स बनाने के लिए लागू किया है। ये प्रोजेक्ट्स मेरी तकनीकी कौशलों को ही नहीं तोड़ने के साथ-साथ मुझे अद्वितीय उपयोगकर्ता अनुभव के महत्व को भी समझाया है।",
      "tools": "मेरे तकनीकी कौशलों के अलावा, मैं सहयोगात्मक सॉफ़्टवेयर विकास के लिए महत्वपूर्ण उपकरण और अभ्यासों को अच्छी तरह से जानता हूँ। मैं संस्करण नियंत्रण के लिए Git और GitHub का प्रवीण हूँ और एक Linux परिवेश में काम करने का अनुभव रखता हूँ। मेरी टीम के अंदर काम करने और सर्वश्रेष्ठ कोडिंग प्रैक्टिस का पालन करने की क्षमता मुझे आपकी कंपनी के लिए एक आदर्श उम्मीदवार बनाती है।",
      "problemSolving": "मेरे प्रोफ़ाइल का एक पहलू जिस पर मैं विशेष गर्व करता हूँ, वो मेरे समस्या-समाधान कौशल को निखारने के लिए मेरी समर्पितता है। मैंने स्थायी रूप से LeetCode पर प्रोग्रामरों के शीर्ष 4% में रैंक होता हूँ और 100 से अधिक प्रतिस्पर्धी प्रोग्रामिंग प्रतियोगिताओं में सक्रिय भाग लिया है। इन अनुभवों के माध्यम से, मैंने जावा में 1000 से अधिक एल्गोरिथ्मिक समस्याओं को सफलतापूर्वक हल किया है। इस पृष्ठभूमि ने मुझे मजबूत विश्लेषणात्मक और महत्वपूर्ण सोचने की क्षमता के साथ लैस किया है जो मुझे विशेषज्ञता के क्षेत्र में जटिल चुनौतियों को सुलझाने के लिए मौनिक और गंभीर विचार क्षमता के साथ संपन्न किया है।",
      "internship": "मेरे Persistent Systems में इंटर्नशिप के दौरान, मुझे वास्तविक-जगही प्रोजेक्ट्स पर काम करने और अनुभवी डेवलपर्स के साथ मिलकर काम करने का मौका मिला। इस अनुभव ने मुझे सॉफ़्टवेयर विकास जीवनकारी, प्रोजेक्ट प्रबंधन, और टीम के अंदर प्रभावी संचालन के महत्व के बारे में अनुभव प्रदान किया।",
      "traits": "मैं उच्च प्रेरित, एक तेज सीखने वाला, और नवाचारों और प्रौद्योगिकियों के नवीनतम उद्योग रुझानों के साथ रहने के बारे में उत्साही हूँ। मुझे विश्वास है कि मेरी वेब डेवलपमेंट के प्रति उत्साह, प्रैक्टिकल अनुभव, और समस्या-समाधान कौशल मुझे आपकी कंपनी के लिए एक मजबूत मिलान है।",
      "conclusion": "मेरे आवेदन को ध्यान में लेने के लिए धन्यवाद। मैं आपके टीम के साथ चर्चा करने के लिए उत्सुक हूँ कि मेरे कौशल और पृष्ठभूमि आपकी कंपनी की आवश्यकताओं के साथ कैसे मेल खाते हैं। मैं आपकी टीम के साथ साक्षात्कार का अवसर देखता हूँ।"
    },
    "exp": {
      "internship": {
        "title": "इंटर्नशिप: पर्सिस्टेंट सिस्टम्स",
        "duration": "जुलाई 2022 - अगस्त 2022",
        "description": "मेरे मार्शियन इंटर्नशिप के दौरान, जो जुलाई 2022 से अगस्त 2022 तक चली, मैंने कई मौलिक कंप्यूटर विज्ञान के अवधारणाओं का व्यापक प्रशिक्षण प्राप्त किया। इन अवधारणाओं में कंप्यूटर नेटवर्क, डेटा संरचनाएँ, एल्गोरिथम, ऑपरेटिंग सिस्टम, डेटाबेस प्रबंधन और ऑब्जेक्ट-ओरिएंटेड प्रोग्रामिंग (OOPS) जैसे विभिन्न फंडामेंटल कंप्यूटर विज्ञान के विभिन्न पहलुओं को शामिल किया गया। इस प्रशिक्षण ने मेरी ज्ञान और कौशल को इन महत्वपूर्ण क्षेत्रों में मजबूत आधार प्रदान किया, कंप्यूटर विज्ञान के क्षेत्र में मेरी जानकारी और कौशल को बढ़ावा दिलाया।"
      },
      "projects": {
        "title": "महत्वपूर्ण प्रोजेक्ट्स",
        "captionizer": {
          "title": "कैप्शनाइज़र",
          "duration": "मई 2022 - जुलाई 2022",
          "description": "प्रोजेक्ट 'कैप्शनाइज़र' में, जिसे मई 2022 से जुलाई 2022 तक आयोजित किया गया, मैंने सोशल मीडिया पोस्ट्स के लिए कैप्शन बनाने की प्रक्रिया को सरल बनाने का एक नवाचारी समाधान विकसित किया। इस AI-संचालित सिस्टम ने प्रयोक्ताओं को समय बचाने में सहायक होने के रूप में प्रासंगिक और आकर्षक कैप्शन उत्पन्न किए हैं, जिससे उपयोक्ताओं के लिए जोकिने अन्यथा मैन्युअल इंटरनेट ब्राउज़ करने में बिताए जाने वाले मूल्यवान समय को बचाया जा सकता है। इसे प्राप्त करने के लिए, मैंने इमेजएआई मॉड्यूल का उपयोग तिनीवायोलोवी4 और नैचुरल लैंग्वेज टूलकिट (NLTK) के साथ कर एल्गोरिथ्म को लागू किया। इसके अलावा, मैंने पीछे कार्यक्रमिता की समर्थन के लिए एक फ्लास्क API बनाया और सिस्टम के साथ सहसंवाद के लिए एक उपयोगकर्ता-सौहार्द्यपूर्ण रियैक्ट फ्रंटएंड डिज़ाइन किया।"
        },
        "multiplayergame": {
          "title": "मल्टीप्लेयर गेम",
          "duration": "जुलाई 2021 - सितंबर 2021",
          "description": "मेरी शामिली 'मल्टीप्लेयर गेम' प्रोजेक्ट में, जिसे जुलाई 2021 से सितंबर 2021 तक आयोजित किया गया, ने मुझे आकर्षक और इंटरैक्टिव ऑनलाइन अनुभव विकसित करने में मेरी दक्षता का प्रदर्शन करने का अवसर प्रदान किया। विशेष रूप से, मैंने रियल-टाइम मल्टीप्लेयर वेब गेम डिज़ाइन और बनाया, जो क्लासिक रॉक-पेपर-सीझर्स खेल पर आधारित था। रियल-टाइम संचालन के लिए React और Node.js के साथ Socket.io का उपयोग करते हुए, मैंने सुनिश्चित किया कि खिलाड़ी लाइव, एनिमेटेड गेमप्ले अनुभव कर सकते हैं। यह गेम मोबाइल रिस्पॉन्सिव है और हेरोकू प्लेटफ़ॉर्म पर होस्ट है, जिससे एक बड़े दर्शकों को गेम का आनंद लेने की सुविधा होती है।"
        },
        "carrentalpagefreelancing": {
          "title": "कार रेंटल पेज फ्रीलांसिंग",
          "duration": "अक्टूबर 2022",
          "description": "अक्टूबर 2022 में, मैंने एक कार रेंटल दुकान की ऑनलाइन मौजूदगी को बढ़ाने पर ध्यान केंद्रित करके फ्रीलांसिंग प्रोजेक्ट को निर्धारित किया। इस प्रोजेक्ट के लिए, मैंने एक मोबाइल रेस्पॉन्सिव वेब पेज विकसित किया, जिसका उद्देश्य संभावित ग्राहकों की ध्यान आकर्षित करना था। इस वेबपेज में एक ग्राहक पूछताछ फॉर्म और एक स्मूथ यूआई शामिल है। इसके अलावा, मैंने ग्राहक पूछताछ और बुकिंग को सुविधाजनक बनाने के लिए एक कस्टमर इंक्वायरी फॉर्म एकीकृत किया, जो दुकान के ग्राहक बातचीत और कुल डिजिटल अनुभव को और बेहतर बनाता है।"
        }
      }
    },     
    "achivs":{
      "codechef_ranking_1": {
        "description": "कोडचेफ पर विश्व रैंक 93 और 10,000 प्रतियोगियों के बीच 130 में सुरक्षित किया।",
        "explanation": "यह उपलब्धि दिखाती है कि मैंने कोडचेफ पर प्रोग्रामिंग प्रतियोगिताओं में अत्यधिक प्रदर्शन किया। लगभग 10,000 प्रतिभागियों के बीच, मैंने वैश्विक रैंकिंग 93 और 130 प्राप्त की है। कोडचेफ प्रतिस्पर्धी प्रोग्रामिंग के लिए एक प्रसिद्ध प्लेटफार्म है, और इस तरह की रैंकिंग मेरे मजबूत कोडिंग और समस्या समाधान कौशल को दिखाती है।"
      },
      "codechef_ranking_2": {
        "description": "कोडचेफ पर 4 स्टार (अधिकतम रेटिंग 1805)।",
        "explanation": "इसका मतलब है कि कोडचेफ पर मुझे 4 स्टार की रेटिंग मिली है, और उच्चतम रेटिंग 1805 है। कोडचेफ प्रतिभागियों को प्रतियोगिताओं में और समस्या समाधान कौशल में उनकी प्रदर्शन के आधार पर रेटिंग देता है। 4 स्टार रेटिंग प्राप्त करना एक महत्वपूर्ण उपलब्धि है और कोडिंग चुनौतियों में मेरे दक्षता को प्रकट करता है।"
      },
      "leetcode_ranking": {
        "description": "LeetCode पर 350,000 प्रोग्रामर्स के बीच वैश्विक रैंकिंग के तहत वैश्विक रूप से शीर्ष 4%। अधिकतम रेटिंग 1888।",
        "explanation": "इस उपलब्धि से यह प्रकट होता है कि मेरा प्रदर्शन LeetCode पर शीर्ष 4% के बीच वैश्विक रूप से है, जिसमें 350,000 प्रोग्रामर्स का समूह होता है। साथ ही, मैंने अधिकतम रेटिंग 1888 प्राप्त की है, जिससे मेरी जटिल कोडिंग समस्याओं को समाधान करने की क्षमता को प्रकट किया गया है। LeetCode को उसकी चुनौतीपूर्ण कोडिंग चुनौतियों के लिए जाना जाता है, जिससे इस उपलब्धि को महत्वपूर्ण बनाता है।"
      },
      "hackerrank_rating": {
        "description": "HackerRank पर Java प्रोग्रामिंग में 5 स्टार और Problem-solving में 4 स्टार [id: rohitmirchandani]।",
        "explanation": "HackerRank पर मुझे Java प्रोग्रामिंग में 5 स्टार और Problem-solving में 4 स्टार की रेटिंग प्राप्त हुई है, जिससे मेरी Java भाषा, संबंधित अवधारणाओं की मास्टरी और विभिन्न एल्गोरिथ्मिक और कोडिंग चुनौतियों को संघटित करने की क्षमता प्रमाणित होती है। HackerRank कोडिंग कौशल में माहिर होने के लिए एक प्रतिष्ठित प्लेटफार्म है, और ये रेटिंग्स मेरी योग्यता को प्रमाणित करती हैं।"
      },
      "problem_solving_count": {
        "description": "LeetCode, HackerRank, CodeChef, GeeksForGeeks जैसे विभिन्न कोडिंग प्लेटफार्मों पर समस्या का समाधान किया है, जिसमें 800+ समस्याओं का हल निकाला गया है।",
        "explanation": "मैंने विभिन्न कोडिंग प्लेटफार्मों में, जैसे LeetCode, HackerRank, CodeChef, GeeksForGeeks, समेत, अधिकांश 800 से अधिक समस्याओं का सफलतापूर्वक समाधान किया है। इस बहुमुखी समस्या समाधान अनुभव से मेरी कोडिंग कौशल में सुधारने की प्रतिबद्धता और विविध कोडिंग चुनौतियों को समाधान करने की क्षमता का प्रदर्शन होता है।"
      },
      "webdev_certification": {
        "description": "CCA (Cambridge Certification Authority) द्वारा वेब विकास में प्रमाणित।",
        "explanation": "इस प्रमाणन से मेरी वेब विकास में विशेषज्ञता प्रमाणित होती है, शायद CCA (Cambridge Certification Authority) या उसी प्रकार के संगठन द्वारा प्रशिक्षण और परीक्षण के माध्यम से प्राप्त होता है। यह सॉफ़्टवेयर विकास के क्षेत्र में मौजूदा प्रौद्योगिकियों और प्रथाओं की प्रोफ़ेशनलता की पुष्टि करता है, जो सॉफ़्टवेयर विकास के क्षेत्र में मूल्यवान है।"
      }
    }    
  }